druzyek/RPN_Calculator/MSP430/rpnmain.c
/**   RPN Scientific Calculator for MSP430
 *    Copyright (C) 2014 Joey Shepard
 *
 *    This program is free software: you can redistribute it and/or modify
 *    it under the terms of the GNU General Public License as published by
 *    the Free Software Foundation, either version 3 of the License, or
 *    (at your option) any later version.
 *
 *    This program is distributed in the hope that it will be useful,
 *    but WITHOUT ANY WARRANTY; without even the implied warranty of
 *    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *    GNU General Public License for more details.
 *
 *    You should have received a copy of the GNU General Public License
 *    along with this program.  If not, see <http://www.gnu.org/licenses/>.
**/

#include <msp430.h>
#include <stdbool.h>
#include "common.h"

#define RAM_BANK        BIT0  //P1.0 SRAM bank
#define UART_RXD        BIT1  //P1.1 To TXD of slave
#define UART_TXD        BIT2  //P1.2 To RXD of slave
#define SR_CLOCK        BIT3  //P1.3 165 clock
#define SR_LATCH        BIT4  //P1.4 165 latch
#define SR_DATA         BIT5  //P1.5 165 data
#define BUFFER_EN       BIT6  //P1.6 Enable LCD bus buffer
#define LCD_EN          BIT7  //P1.7 LCD clock "Enable"

#define LCD_BUS               //P2.0 - P2.3
#define LCD_DATA        BIT4  //P2.4 LCD data bit
#define KEY_BUS               //P2.0 - P2.5
#define LED_2ND         BIT7  //P2.7 LED for 2nd button

#define LCD_CYCLES 1000

#define KEY_ENTER     13
#define KEY_BACKSPACE 8
#define KEY_DELETE    83
#define KEY_ESCAPE    27
#define KEY_LEFT      75
#define KEY_RIGHT     77
#define KEY_DOWN      80
#define KEY_UP        72

#define SCREEN_WIDTH 20

static const char KeyMatrix[]={0 ,'z','0','.','m','+','p','r',
                                  'd','1','2','3','-','x','q',
                                  'w','4','5','6','*','n','u',
                                   13,'7','8','9','/', 83, 8 ,
                                  'b','s','c','t', 75, 80, 77,
                                  ' ','e','l','v','o', 72, 27};

#pragma MM_READ RAM_Read
#pragma MM_WRITE RAM_Write
#pragma MM_ON

static void Init();

static void LCD_Nibble(unsigned char nibble, unsigned char RS);
static void LCD_Byte(unsigned char byte, unsigned char RS);
static void LCD_Init();
static void LCD_Text(const char *msg);
static void LCD_Num(unsigned int num);
static void LCD_Hex(unsigned int num);

static void SetBlink(bool status);
static void gotoxy(short x, short y);
static unsigned char GetKey();

static unsigned char RAM_Read(const unsigned char *a1);
static void RAM_Write(const unsigned char *a1, const unsigned char byte);

static void AddBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void SubBCD(unsigned char *result, const unsigned char *n1, unsigned char *n2);
static void ImmedBCD(const char *text, unsigned char *BCD);
static void BufferBCD(const unsigned char *text, unsigned char *BCD);
static void PrintBCD(const unsigned char *BCD, int dec_point);
static void MultBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void DivBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void ShrinkBCD(unsigned char *dest,unsigned char *src);
static void FullShrinkBCD(unsigned char *n1);
static void PadBCD(unsigned char *n1, int amount);
static bool IsZero(unsigned char *n1);
static void CopyBCD(unsigned char *dest, unsigned char *src);
static bool LnBCD(unsigned char *result, unsigned char *arg);
static void ExpBCD(unsigned char *result, unsigned char *arg);
static void RolBCD(unsigned char *result, unsigned char *arg, unsigned int amount);
static void RorBCD(unsigned char *result, unsigned char *arg, unsigned int amount);
static void PowBCD(unsigned char *result, unsigned char *base, unsigned char *exp);
static void TanBCD(unsigned char *sine_result,unsigned char *cos_result,unsigned char *arg);
static void AcosBCD(unsigned char *result,unsigned char *arg);
static void AsinBCD(unsigned char *result,unsigned char *arg);
static void AtanBCD(unsigned char *result,unsigned char *arg);
static void CalcTanBCD(unsigned char *result1,unsigned char *result2,unsigned char *result3,unsigned char *arg,unsigned char flag);
static unsigned char CompBCD(const char *num, unsigned char *var);
static unsigned char CompVarBCD(unsigned char *var1, unsigned char *var2);
static unsigned char TrigPrep(unsigned int stack_ptr_copy,int *cosine);

static void DrawStack(bool menu, bool input, int stack_pointer);
static void DrawInput(unsigned char *line, int input_ptr, int offset, bool menu);
static void ErrorMsg(const char *msg);
static void Number2(int num);
static void SetDecPlaces();

static void TestRAM();

#define ClrLCD() LCD_Byte(1,0)
#define putchar(x) LCD_Byte(x,1)

#pragma MM_OFFSET 0
#pragma MM_GLOBALS
  unsigned char p0[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD, typing,    CompBCD
  unsigned char p1[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD, DrawStack, CompBCD, CompVarBCD
  unsigned char p2[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD
  unsigned char p3[260]; //PowBCD
  unsigned char p4[260]; //PowBCD
  unsigned char p5[260];
  unsigned char p6[260];
  unsigned char p7[260];
  unsigned char buffer[260]; //AddBCD
  unsigned char perm_buff1[260]; //DivBCD, MultBCD
  unsigned char perm_buff2[260]; //DivBCD
  unsigned char perm_buff3[260]; //DivBCD
  //unsigned char logs[MATH_LOG_TABLE*MATH_ENTRY_SIZE];
  unsigned char logs[4218];
  //unsigned char trig[MATH_TRIG_TABLE*MATH_ENTRY_SIZE];
  unsigned char trig[4218];
  unsigned char perm_zero[4];
  unsigned char perm_K[36];
  unsigned char perm_log10[36];
  unsigned char BCD_stack[52000];
  unsigned char stack_buffer[260];
#pragma MM_END

struct SettingsType Settings;
unsigned int stack_ptr[2];
unsigned int which_stack;

int main(void)
{
  WDTCTL=WDTPW + WDTHOLD;

  BCSCTL1=CALBC1_16MHZ;
  DCOCTL=CALDCO_16MHZ;

  BCSCTL3 |= LFXT1S_2;

  UCA0CTL1=UCSWRST|UCSSEL_2;
  UCA0CTL0 = 0;
  UCA0MCTL = UCBRS_5;
  UCA0BR0 = 131;
  UCA0BR1 = 0;
  UCA0CTL1&=~UCSWRST;

  P1SEL=(UART_TXD|UART_RXD);
  P1SEL2=(UART_TXD|UART_RXD);

  P2SEL=0;
  P2SEL2=0;

