druzyek/RPN_Calculator/MSP430/rpnmain.c
  P1OUT=BUFFER_EN;
  P2OUT=0;

  P1DIR=0xFF & ~(UART_TXD|UART_RXD|SR_DATA);
  P2DIR=0xFF;

  #pragma MM_ASSIGN_GLOBALS

  int key,i=0,j=0,k=0,x=0,y=0;
  bool shift=false, clear_shift=false, redraw=true, input=false;
  bool menu=false, redraw_input=false, do_input=false;
  int input_ptr=0, input_offset=0;
  int process_output=0;
  static const char StartInput[]="0123456789.";

  Init();

  do
  {
    if (redraw)
    {
      ClrLCD();
      DrawStack(menu,input,stack_ptr[which_stack]);
      redraw=false;
    }
    if (redraw_input)
    {
      DrawInput(p0,input_ptr,input_offset,menu);
      redraw_input=false;
    }

    do
    {
      key=KeyMatrix[GetKey()];
    } while (key==0);
    while (KeyMatrix[GetKey()]);

    j=0;
    do
    {
      if (key==StartInput[j])
      {
        j=0;
        break;
      }
    }while(StartInput[j++]);

    if (j==0)//numbers
    {
      if (input==false)
      {
        if (stack_ptr[which_stack]==STACK_SIZE)
        {
          ErrorMsg("Stack full");
          redraw=true;
        }
        else
        {
          input=true;
          ClrLCD();
          DrawStack(menu,input,stack_ptr[which_stack]);
          input_offset=0;
          input_ptr=1;
          p0[0]=key;
          p0[1]=0;
          redraw_input=true;
          SetBlink(true);
        }
      }
      else
      {
        if (input_ptr<255)
        {
          k=0;
          for (j=input_ptr;p0[j];j++) k++;
          for (j=k;j>=0;j--) p0[input_ptr+j+1]=p0[input_ptr+j];
          p0[input_ptr++]=key;

          if (input_ptr-input_offset==(SCREEN_WIDTH-1))
          {
            if (p0[input_ptr]==0) input_offset+=0;
            else if ((p0[input_ptr]!=0)&&(p0[input_ptr+1]==0)) input_offset+=0;
            else input_offset++;
          }
          else if (input_ptr-input_offset==(SCREEN_WIDTH))
          {
            if (p0[input_ptr]==0) input_offset++;
            else input_offset++;
          }
          redraw_input=true;
        }
      }
    }
    else//not numbers
    {
      if (input)
      {
        switch(key)
        {
          case KEY_BACKSPACE:
            if (input_ptr)
            {
              input_ptr--;
              if (input_ptr-input_offset==0) input_offset-=2;
              else if (input_ptr-input_offset<2) input_offset--;
              if (input_offset<0) input_offset=0;
              j=input_ptr;
              while (p0[j])
              {
                p0[j]=p0[j+1];
                j++;
              }
              redraw_input=true;
            }
            key=0;
            break;
          case KEY_DELETE:
            j=input_ptr;
            while (p0[j])
            {
              p0[j]=p0[j+1];
              j++;
            }
            redraw_input=true;
            key=0;
            break;
          case KEY_LEFT://left
            if (input_ptr)
            {
              input_ptr--;
              if (input_ptr-input_offset==0) input_offset--;
              if (input_offset<0) input_offset=0;
              redraw_input=true;
            }
            key=0;
            break;
          case KEY_RIGHT://right
            if (p0[input_ptr])
            {
              input_ptr++;
              if (input_ptr-input_offset==(SCREEN_WIDTH-1))
              {
                if (p0[input_ptr]==0) input_offset+=0;
                else if ((p0[input_ptr]!=0)&&(p0[input_ptr+1]==0)) input_offset+=0;
                else input_offset++;
              }
              else if (input_ptr-input_offset==(SCREEN_WIDTH))
              {
                if (p0[input_ptr]==0) input_offset++;
              }
              redraw_input=true;
            }
            key=0;
            break;
          case KEY_ESCAPE:
            SetBlink(false);
            input=false;
            redraw=true;
            key=0;
            break;
          case KEY_ENTER:
            do_input=true;
            key=0;
            break;
          case 'z':
            input_ptr=0;
            input_offset=0;
            p0[0]=0;
            redraw_input=true;
            key=0;
            break;
          case KEY_DOWN:
          case KEY_UP:
            key=0;
            break;
          case ' ':
            break;
          default: //other key pressed during input
            do_input=true;
        }
      }

      //else redraw=true; //not inputting and not number

      if (do_input)
      {
        x=0;
        for (j=0;p0[j];j++)
        {
          if (p0[j]=='.') x++;
          if (x==2) break;
        }
        if (x==2)
        {
          ErrorMsg("Invalid input");
          redraw_input=true;
        }
        else if (p0[0]==0)
        {
          SetBlink(false);
          input=false;
          redraw=true;
          key=0;
        }
        else
        {
          SetBlink(false);
          BufferBCD(p0,BCD_stack+stack_ptr[which_stack]*MATH_CELL_SIZE);
          if (IsZero(BCD_stack+stack_ptr[which_stack]*MATH_CELL_SIZE)&&(BCD_stack[stack_ptr[which_stack]*MATH_CELL_SIZE+BCD_SIGN])) BCD_stack[stack_ptr[which_stack]*MATH_CELL_SIZE+BCD_SIGN]=0;
          FullShrinkBCD(BCD_stack+stack_ptr[which_stack]*MATH_CELL_SIZE);
          stack_ptr[which_stack]++;
          input=false;
        }
        redraw=true;
        do_input=false;
      }

      clear_shift=true;
      process_output=0;
      switch (key)
      {
        case '+':
          if (stack_ptr[which_stack]>=2)
          {
            AddBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            process_output=2;
            redraw=true;
          }
          break;
        case '-':
          if (stack_ptr[which_stack]>=2)
          {
            SubBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            process_output=2;
            redraw=true;
          }
          break;
        case '/':
          if (!shift)
          {
            if (stack_ptr[which_stack]>=2)
            {
              if (IsZero(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
              {
                ErrorMsg("Divide by zero");
              }
              else
              {
                DivBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                process_output=2;
              }
              redraw=true;
            }
          }
          else//mod
          {
            if (stack_ptr[which_stack]>=2)
            {
              if (IsZero(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
              {
                ErrorMsg("Invalid Input");
              }
              else
              {
                CopyBCD(p3,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE);
                CopyBCD(p2,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);

                if (p3[BCD_SIGN]==1) j=1;
                else j=0;
                p3[BCD_SIGN]=0;
                p2[BCD_SIGN]=0;

                while(1)
                {
                  SubBCD(p0,p3,p2);
                  if (p0[BCD_SIGN])
                  {
                    CopyBCD(stack_buffer,p3);
                    break;
                  }
                  else CopyBCD(p3,p0);
                }
                stack_buffer[BCD_SIGN]=j;
                process_output=2;
              }
              redraw=true;
            }
          }
          break;
        case '*':
          if (stack_ptr[which_stack]>=2)
          {
            MultBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            process_output=2;
            redraw=true;
          }
          break;
        case KEY_BACKSPACE:
        case KEY_DELETE:
          if (stack_ptr[which_stack]>=1)
          {
            stack_ptr[which_stack]--;
            redraw=true;
          }
          break;
        case KEY_ENTER:
        case 'd'://dupe
          if (stack_ptr[which_stack]>=1)
          {
            if (stack_ptr[which_stack]==STACK_SIZE)
            {
              ErrorMsg("Stack full");
            }
            else
            {
              CopyBCD(BCD_stack+(stack_ptr[which_stack])*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              stack_ptr[which_stack]++;
            }
            redraw=true;
          }
          break;
        case KEY_LEFT:
          if (stack_ptr[which_stack]>=1)
          {
            RolBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,1);
            process_output=1;
            redraw=true;
          }
          break;
        case KEY_RIGHT:
          if (stack_ptr[which_stack]>=1)
          {
            RorBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,1);
            process_output=1;
            redraw=true;
          }
          break;
        case KEY_UP:
          if (stack_ptr[which_stack]>=2)
          {
            CopyBCD(stack_buffer,BCD_stack);
            for (i=0;i<(stack_ptr[which_stack]-1);i++)
            {
              CopyBCD(BCD_stack+i*MATH_CELL_SIZE,BCD_stack+(i+1)*MATH_CELL_SIZE);
            }
            CopyBCD(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,stack_buffer);
            redraw=true;
          }
          break;
        case KEY_DOWN:
          if (stack_ptr[which_stack]>=2)
          {
            CopyBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            for (i=(stack_ptr[which_stack]-1);i>0;i--)
            {
              CopyBCD(BCD_stack+(i)*MATH_CELL_SIZE,BCD_stack+(i-1)*MATH_CELL_SIZE);
            }
            CopyBCD(BCD_stack,stack_buffer);
            redraw=true;
          }
          break;
        case ' '://shift
          shift=!shift;
          if (shift) P2OUT|=LED_2ND;
          else P2OUT&=~LED_2ND;
          clear_shift=false;
          break;
        case 'b'://test
          P1OUT&=~RAM_BANK;
          TestRAM();
          P1OUT|=RAM_BANK;
          TestRAM();

          if (which_stack==0) P1OUT&=~RAM_BANK;
          else P1OUT|=RAM_BANK;

          ClrLCD();
          LCD_Text("Press a key...");
          gotoxy(0,2);
          LCD_Text("Key: 00");
          gotoxy(0,3);
          LCD_Text("Code: 00");
          i=0;
          j=0;
          do
          {
            j=GetKey();
            if (j!=i)
            {
              gotoxy(5,2);
              LCD_Hex(j);
              gotoxy(6,3);
              LCD_Hex(KeyMatrix[j]);
              i=j;
            }
          } while (KeyMatrix[j]!=27);
          key=0;
          redraw=true;
          break;
        case 'c'://cosine
          if (!shift)
          {
            if (stack_ptr[which_stack]>=1)
            {
              BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=0;
              TrigPrep(stack_ptr[which_stack],&j);
              if (IsZero(p3)) ImmedBCD("1",stack_buffer);
              else TanBCD(p4,stack_buffer,p3);
              if (j==1) stack_buffer[BCD_SIGN]=1;
              process_output=1;
              redraw=true;
            }
          }
          else//acos
          {
            if (stack_ptr[which_stack]>=1)
            {
              process_output=1;
              i=CompBCD("0",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              j=CompBCD("1",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              k=CompBCD("-1",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              if (i==COMP_EQ) ImmedBCD("90",stack_buffer);
              else if (j==COMP_EQ) ImmedBCD("0",stack_buffer);
              else if (k==COMP_EQ) ImmedBCD("180",stack_buffer);
              else if ((j==COMP_LT)||(k==COMP_GT))
              {
                ErrorMsg("Invalid input");
                process_output=0;
              }
              else AcosBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              redraw=true;
            }
          }
          break;
        case 'e'://e^x
          if (!shift)
          {
            if (stack_ptr[which_stack]>=1)
            {
              if (CompBCD("177",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)==COMP_LT)
              {
                ErrorMsg("Argument\ntoo large");
              }
              else
              {
                ExpBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                process_output=1;
              }
              redraw=true;
            }
          }
          else//10^x
          {
            if (stack_ptr[which_stack]>=1)
            {
              x=0;
              j=CompVarBCD(perm_zero,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);

              if (j==COMP_EQ) ImmedBCD("1",stack_buffer);
              else
              {
                if (j==COMP_GT) j=1;
                else j=0;
                BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=0;

                CopyBCD(p2,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                p2[BCD_LEN]=p2[BCD_DEC];
                if (CompVarBCD(p2,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)==COMP_EQ)//x is an integer
                {
                  ImmedBCD("254",p2);
                  if (CompVarBCD(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,p2)==COMP_GT)
                  {
                    i=255;
                  }
                  else
                  {
                    i=BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+3]*100;
                    i+=BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+4]*10;
                    i+=BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+5];
                    if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_DEC]==2) i/=10;
                    else if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_DEC]==1) i/=100;
                  }

