druzyek/RPN_Calculator/MSP430/rpnmain.c
                  if (i>254)
                  {
                    ErrorMsg("Invalid input");
                    BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=j;
                    x=1;
                  }
                  else
                  {
                    stack_buffer[BCD_SIGN]=0;
                    stack_buffer[BCD_DEC]=i+1;
                    stack_buffer[BCD_LEN]=i+1;
                    stack_buffer[3]=1;
                    for (k=0;k<i;k++)
                    {
                      stack_buffer[k+4]=0;
                    }
                  }
                }
                else
                {
                  ImmedBCD("10",p5);
                  PowBCD(stack_buffer,p5,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                  if (stack_buffer[BCD_DEC]>(Settings.DecPlaces)) stack_buffer[BCD_LEN]=stack_buffer[BCD_DEC];
                  else if (stack_buffer[BCD_LEN]>(Settings.DecPlaces))
                  {
                    stack_buffer[BCD_LEN]=Settings.DecPlaces;
                  }
                }

                if ((j)&&(x==0))
                {
                  ImmedBCD("1",p2);
                  DivBCD(p3,p2,stack_buffer);
                  CopyBCD(stack_buffer,p3);
                }
              }
              if (x==0) process_output=1;
              redraw=true;
            }
          }
          break;
        case 'i'://pi
          if (stack_ptr[which_stack]==STACK_SIZE)
          {
            ErrorMsg("Stack full");
          }
          else
          {
            stack_ptr[which_stack]++;
            ImmedBCD(pi,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_LEN]=1+Settings.DecPlaces;
          }
          redraw=true;
          break;
        case 'l'://ln
          if (!shift)
          {
            if (stack_ptr[which_stack]>=1)
            {
              if (CompVarBCD(perm_zero,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)!=COMP_LT)
              {
                ErrorMsg("Invalid input");
              }
              else
              {
                if (LnBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)) process_output=1;
                else ErrorMsg("Argument\ntoo large");
              }
              redraw=true;
            }
          }
          else
          {
            if (stack_ptr[which_stack]>=1)
            {
              if (CompVarBCD(perm_zero,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)!=COMP_LT)
              {
                ErrorMsg("Invalid input");
              }
              else
              {
                x=0;
                if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+3]==1)
                {
                  CopyBCD(p0,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);

                  j=p0[BCD_DEC];
                  k=p0[BCD_LEN];
                  for (i=k;i>j;i--)
                  {
                    if (p0[i+2]==0) k--;
                    else break;
                  }

                  p0[BCD_LEN]=k;

                  if (p0[BCD_LEN]==p0[BCD_DEC])
                  {
                    p0[3]=0;
                    if (IsZero(p0))
                    {
                      stack_buffer[BCD_LEN]=3;
                      stack_buffer[BCD_DEC]=3;
                      stack_buffer[BCD_SIGN]=0;
                      i=p0[BCD_LEN]-1;
                      stack_buffer[3]=i/100;
                      stack_buffer[4]=(i%100)/10;
                      stack_buffer[5]=(i%10);
                      FullShrinkBCD(stack_buffer);
                      process_output=1;
                      x=1;
                    }
                  }
                }

                if (!x)
                {
                  if (LnBCD(p3,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
                  {
                    DivBCD(stack_buffer,p3,perm_log10);
                    process_output=1;
                  }
                  else ErrorMsg("Argument\ntoo large");
                }
              }
              redraw=true;
            }
          }
          break;
        case 'm':// +/-
          if (stack_ptr[which_stack]>=1)
          {
            if (CompVarBCD(perm_zero,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE)!=COMP_EQ)
            {
              if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]==0)
              {
                BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=1;
              }
              else BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=0;
            }
            redraw=true;
          }
          break;
        case 'n':// 1/x
          if (stack_ptr[which_stack]>=1)
          {
            if (IsZero(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
            {
              ErrorMsg("Divide by zero");
            }
            else
            {
              ImmedBCD("1",p0);
              DivBCD(stack_buffer,p0,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              process_output=1;
            }
            redraw=true;
          }
          break;
        case 'o'://round
          if (stack_ptr[which_stack]>=1)
          {
            if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_LEN]>BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_DEC])
            {
              BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_LEN]=BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_DEC];
              if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_LEN]+3]>4)
              {
                ImmedBCD("1",p0);
                AddBCD(stack_buffer,p0,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              }
              else CopyBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              process_output=1;
            }
            redraw=true;
          }
          break;
        case 'p'://y^x
        case 'r'://x root y
          if (stack_ptr[which_stack]>=2)
          {
            x=0;
            if (key=='r')
            {
              if (IsZero(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
              {
                ErrorMsg("Invalid Input");
                x=1;
              }
              else
              {
                ImmedBCD("1",p3);
                DivBCD(p5,p3,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
              }
            }
            else CopyBCD(p5,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);

