druzyek/RPN_Calculator/MSP430/rpnmain.c
            if (x==0)
            {
              j=CompVarBCD(perm_zero,p5);
              k=CompVarBCD(perm_zero,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE);

              if (k==COMP_GT)
              {
                y=1;
                BCD_stack[(stack_ptr[which_stack]-2)*MATH_CELL_SIZE+BCD_SIGN]=0;
              }
              else y=0;

              if (j==COMP_GT)
              {
                y+=2;
                p5[BCD_SIGN]=0;
              }

              if (k==COMP_EQ) ImmedBCD("0",stack_buffer);
              else if (j==COMP_EQ) ImmedBCD("1",stack_buffer);
              else
              {
                CopyBCD(p2,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE);
                p2[BCD_LEN]=p2[BCD_DEC];
                if (CompVarBCD(p2,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE)==COMP_EQ) j=1;
                else j=0;
                CopyBCD(p2,p5);
                p2[BCD_LEN]=p2[BCD_DEC];
                if (CompVarBCD(p2,p5)==COMP_EQ) j+=2;

                if (y&1)//y is negative
                {
                  if (j&2)//x is an integer
                  {
                    ///BCD_stack[(stack_ptr[which_stack]-2)*MATH_CELL_SIZE+BCD_SIGN]=0;
                  }
                  else
                  {
                    ErrorMsg("Invalid input");
                    BCD_stack[(stack_ptr[which_stack]-2)*MATH_CELL_SIZE+BCD_SIGN]=(y&1);
                    x=1;
                  }
                }

                if (x==0)
                {
                  PowBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,p5);
                  if (stack_buffer[BCD_DEC]>(Settings.DecPlaces))
                  {
                    stack_buffer[BCD_LEN]=stack_buffer[BCD_DEC];
                  }
                  else if (stack_buffer[BCD_LEN]>(Settings.DecPlaces))
                  {
                    stack_buffer[BCD_LEN]=Settings.DecPlaces;
                  }
                  if (y&2)
                  {
                    ImmedBCD("1",p2);
                    DivBCD(p3,p2,stack_buffer);
                    CopyBCD(stack_buffer,p3);
                  }

                  if (y&1)
                  {
                    if (p5[p5[BCD_DEC]+2]%2==1)
                    {
                      stack_buffer[BCD_SIGN]=(y&1);
                    }
                  }
                }
                if (x==0) process_output=2;
              }
            }
            redraw=true;
          }
          break;
        case 'q'://sqrt
          if (stack_ptr[which_stack]>=1)
          {
            if (IsZero(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE))
            {
              ImmedBCD("0",stack_buffer);
              process_output=1;
            }
            else if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]==1)
            {
              ErrorMsg("Invalid input");
            }
            else
            {
              ImmedBCD("0.5",p5);
              PowBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,p5);
              if (stack_buffer[BCD_DEC]>(Settings.DecPlaces)) stack_buffer[BCD_LEN]=stack_buffer[BCD_DEC];
              else if (stack_buffer[BCD_LEN]>(Settings.DecPlaces))
              {
                stack_buffer[BCD_LEN]=Settings.DecPlaces;
              }
              process_output=1;
            }
            redraw=true;
          }
          break;
        case 's'://sin
        case 't'://tan
          if (!shift)
          {
            if (stack_ptr[which_stack]>=1)
            {
              if (BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]==1)
              {
                BCD_stack[(stack_ptr[which_stack]-1)*MATH_CELL_SIZE+BCD_SIGN]=0;
                j=1;
              }
              else j=0;
              j+=TrigPrep(stack_ptr[which_stack],&k);

              if ((key=='t')&&(CompBCD("90",p3)==COMP_EQ))
              {
                ErrorMsg("Invalid input");
              }
              else
              {
                TanBCD(stack_buffer,p4,p3);
                if (CompBCD("90",p3)==COMP_EQ) ImmedBCD("1",stack_buffer);
                if (j==1) stack_buffer[BCD_SIGN]=1;
                if (k==1) p4[BCD_SIGN]=1;

                if (key=='t')
                {
                  DivBCD(p3,stack_buffer,p4);
                  CopyBCD(stack_buffer,p3);
                }
                process_output=1;
              }
              redraw=true;
            }
          }
          else
          {
            if (key=='s')//asin
            {
              if (stack_ptr[which_stack]>=1)
              {
                process_output=1;
                i=CompBCD("0",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                j=CompBCD("1",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                k=CompBCD("-1",BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                if (i==COMP_EQ) ImmedBCD("0",stack_buffer);
                else if (j==COMP_EQ) ImmedBCD("90",stack_buffer);
                else if (k==COMP_EQ) ImmedBCD("-90",stack_buffer);
                else if ((j==COMP_LT)||(k==COMP_GT))
                {
                  ErrorMsg("Invalid input");
                  process_output=0;
                }
                else AsinBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                redraw=true;
              }
            }
            else//atan
            {
              if (stack_ptr[which_stack]>=1)
              {
                AtanBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
                process_output=1;
                redraw=true;
              }
            }
          }
          break;
        case 'u'://settings
          ClrLCD();
          gotoxy(0,0);
          LCD_Text(">Accuracy:");
          gotoxy(1,1);
          LCD_Text("Deg/rad:");
          gotoxy(1,2);
          LCD_Text("Sci. Not.");
          gotoxy(1,3);
          LCD_Text("Battery:");

