druzyek/RPN_Calculator/MSP430/rpnmain.c
          i=Settings.DecPlaces;
          j=39;
          x=5;
          y=0;
          key=0;
          do
          {
            if (x!=5)
            {
              if (KeyMatrix[key]) delay_ms(500);
              key=KeyMatrix[GetKey()];
            }
            j++;
            if (j==40)
            {
              j=0;
              gotoxy(13,3);

              ADC10CTL0 = SREF_1 + REFON + REF2_5V + ADC10ON + ADC10SHT_3;
              ADC10CTL1 = INCH_11;
              delay_ms(1);
              ADC10CTL0 |= ENC + ADC10SC;

              while (!(ADC10CTL0 & ADC10IFG));
              unsigned long temp=(ADC10MEM * 50001)/10241;

              putchar('0'+temp/1000);
              LCD_Num(temp);
              LCD_Text("mV");

              ADC10CTL0&=~ENC;
              ADC10CTL0=0;
            }

            if ((key==KEY_DOWN)||(key==KEY_UP))
            {
              gotoxy(0,y);
              putchar(' ');

              if ((key==KEY_DOWN)&&(y<2)) y++;
              else if ((key==KEY_UP)&&(y>0)) y--;

              gotoxy(0,y);
              putchar('>');
            }
            else if (key==KEY_RIGHT)
            {
              if (y==0)
              {
                if (Settings.DecPlaces<32)
                {
                  Settings.DecPlaces++;
                  x=1;
                }
              }
            }
            else if (key==KEY_LEFT)
            {
              if (y==0)
              {
                if (Settings.DecPlaces>6)
                {
                  Settings.DecPlaces--;
                  x=1;
                }
              }
            }

            if ((key==KEY_LEFT)||(key==KEY_RIGHT))
            {
              if (y==1)
              {
                Settings.DegRad=!Settings.DegRad;
                x=2;
              }
              else if (y==2)
              {
                Settings.SciNot=!Settings.SciNot;
                x=3;
              }
            }

            if ((x==1)||(x==5))
            {
              gotoxy(17,0);
              Number2(Settings.DecPlaces);
            }
            if ((x==2)||(x==5))
            {
              gotoxy(16,1);
              if (Settings.DegRad) LCD_Text("Deg");
              else LCD_Text("Rad");
            }
            if ((x==3)||(x==5))
            {
              gotoxy(16,2);
              if (Settings.SciNot) LCD_Text(" On");
              else LCD_Text("Off");
            }
            x=0;
          } while ((key!=KEY_ESCAPE)&&(key!=KEY_ENTER));

          if (i!=Settings.DecPlaces) SetDecPlaces();

          UART_Send(SlaveSettings,true);
          UART_Send((unsigned char)Settings.DecPlaces,true);
          UART_Send((unsigned char)Settings.DegRad,true);
          UART_Send((unsigned char)Settings.LogTableSize,true);
          UART_Send((unsigned char)Settings.TrigTableSize,true);

          key=0;
          redraw=true;
          break;
        case 'v'://switch stack
          if (which_stack==0)
          {
            which_stack=1;
            P1OUT|=RAM_BANK;
          }
          else
          {
            which_stack=0;
            P1OUT&=~RAM_BANK;
          }
          redraw=true;
          break;
        case 'w'://swap
          if (stack_ptr[which_stack]>=2)
          {
            CopyBCD(stack_buffer,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            CopyBCD(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE);
            CopyBCD(BCD_stack+(stack_ptr[which_stack]-2)*MATH_CELL_SIZE,stack_buffer);
            redraw=true;
          }
          break;
        case 'x'://x^2
          if (stack_ptr[which_stack]>=1)
          {
            CopyBCD(p0,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            MultBCD(stack_buffer,p0,BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE);
            process_output=1;
            redraw=true;
          }
          break;
        case 'y':
          key=KEY_ESCAPE;
          break;
        case 'z'://clear
          if (stack_ptr[which_stack]>=1)
          {
            stack_ptr[which_stack]=0;
            redraw=true;
          }
          break;
        default:
          process_output=0;
      }

      if (Settings.DegRad==false)
      {
        if ((key=='a')||(key=='g')||(key=='h'))
        {
          if (process_output>0)
          {
            CopyBCD(p0,stack_buffer);
            ImmedBCD(deg_factor,p1);
            DivBCD(stack_buffer,p0,p1);
          }
        }
      }

      if (process_output==2) stack_ptr[which_stack]--;
      if (process_output>0)
      {
        FullShrinkBCD(stack_buffer);
        if (IsZero(stack_buffer)&&(stack_buffer[BCD_SIGN])) stack_buffer[BCD_SIGN]=0;
        CopyBCD(BCD_stack+(stack_ptr[which_stack]-1)*MATH_CELL_SIZE,stack_buffer);
      }
    }
    if (clear_shift)
    {
      shift=false;
      P2OUT&=~LED_2ND;
    }
    clear_shift=false;
  } while (key!=KEY_ESCAPE);
  for (;;) {_BIS_SR(LPM3_bits);}
  return 0;
}

static void Init()
{
  unsigned int i=0;

  LCD_Init();

  Settings.DecPlaces=12;
  Settings.DegRad=true;
  Settings.LogTableSize=MATH_LOG_TABLE;
  Settings.SciNot=false;
  Settings.TrigTableSize=MATH_TRIG_TABLE;
  stack_ptr[0]=0;
  stack_ptr[1]=0;
  which_stack=0;

  UC0IFG&=~UCA0RXIFG;
  LCD_Text("Syncing");
  while(1)
  {
    UART_Send(SlaveSync,false);
    delay_ms(1);
    if ((UC0IFG&UCA0RXIFG))
    {
      gotoxy(7,0);
      if (UCA0RXBUF==SlaveAnswer)
      {
        LCD_Text("...Done");
        UART_Ready();
        break;
      }
      else
      {
        LCD_Text("...Failed!");

        for(;;);
      }
    }
    switch (i++)
    {
      case 1:
        gotoxy(7,0);
        LCD_Text("   ");
        gotoxy(7,0);
        break;
      case 500:
      case 1000:
      case 1500:
        putchar('.');
        break;
      case 2000:
        i=0;
    }
  }


  gotoxy(0,1);
  LCD_Text("Writing RAM 0...");
  ImmedBCD("0",perm_zero);
  ImmedBCD(K,perm_K);
  ImmedBCD(log10_factor,perm_log10);
  UART_Send(SlaveMakeTables,true);
  UART_Receive(true);
  gotoxy(16,1);
  LCD_Text("Done");

  gotoxy(0,2);
  LCD_Text("Writing RAM 1...");
  P1OUT|=RAM_BANK;
  ImmedBCD("0",perm_zero);
  ImmedBCD(K,perm_K);
  ImmedBCD(log10_factor,perm_log10);
  UART_Send(SlaveMakeTables,true);
  UART_Receive(true);
  gotoxy(16,2);
  LCD_Text("Done");

