druzyek/RPN_Calculator/MSP430/rpnmain.c
  P1OUT&=~RAM_BANK;
  SetDecPlaces();

  UART_Send(SlaveSettings,true);
  UART_Send((unsigned char)Settings.DecPlaces,true);
  UART_Send((unsigned char)Settings.DegRad,true);
  UART_Send((unsigned char)Settings.LogTableSize,true);
  UART_Send((unsigned char)Settings.TrigTableSize,true);

  static unsigned const char CustomChars[]={0,0,0,0,0,0,7,4,         //CUST_NW
                                            0,0,0,0,0,0,28,4,        //CUST_NE
                                            4,4,4,4,4,4,4,4,         //CUST_WE
                                            4,7,0,0,0,0,0,0,         //CUST_SW
                                            0,31,0,0,0,0,0,0,        //CUST_S
                                            31,16,23,21,23,16,31,0,  //CUST_OK_O
                                            31,1,21,25,21,1,31,0,    //CUST_OK_K
                                            31,0,17,27,27,17,0,31};  //Busy hour glass

  LCD_Byte(0x40,0);
  for (i=0;i<64;i++) LCD_Byte(CustomChars[i],1);
}

static void LCD_Nibble(unsigned char nibble, unsigned char RS)
{
  P1OUT&=~BUFFER_EN;

  P2OUT&=0xF0;
  P2OUT|=(nibble&0xF);

  if (RS!=0) P2OUT|=LCD_DATA;
  else P2OUT&=~LCD_DATA;

  P1OUT|=LCD_EN;
  __delay_cycles(LCD_CYCLES);
  P1OUT&=~LCD_EN;

  P1OUT|=BUFFER_EN;

  //really?
  delay_ms(1);
}

static void LCD_Byte(unsigned char byte, unsigned char RS)
{
  LCD_Nibble(byte>>4,RS);
  LCD_Nibble(byte,RS);
  if ((RS==0)&&(!(0xFC&byte))&&(byte&0x03)) delay_ms(2);
}

#define DELAY_SMALL 5
#define DELAY_MEDIUM 30
#define DELAY_LARGE 500

static void LCD_Init()
{
  const unsigned char commands[]={0x3,0x3,0x2,0x28,0xE,0x1,0x6,0xC,0x1};

  int i;

  delay_ms(DELAY_LARGE);
  LCD_Nibble(0x3,0);
  delay_ms(DELAY_MEDIUM);

  for (i=0;i<9;i++)
  {
    if (i<3) LCD_Nibble(commands[i],0);
    else LCD_Byte(commands[i],0);
    delay_ms(DELAY_SMALL);
  }
}

static void LCD_Text(const char *msg)
{
  int ptr=0;

  while (msg[ptr]!=0)
  {
    LCD_Byte(msg[ptr],1);
    ptr++;
  }
}

static void LCD_Num(unsigned int num)
{
  if (num>999) num=num % 1000;
  LCD_Byte(num/100+'0',1);
  num-=(num/100*100);
  LCD_Byte(num/10+'0',1);
  num-=(num/10*10);
  LCD_Byte(num+'0',1);
}

static void LCD_Hex(unsigned int num)
{
  if (((num&0xF0)>>4)<10) LCD_Byte(((num&0xF0)>>4)+'0',1);
  else LCD_Byte(((num&0xF0)>>4)-10+'A',1);
  if ((num&0xF)<10) LCD_Byte((num&0xF)+'0',1);
  else LCD_Byte((num&0xF)-10+'A',1);
}

static void SetBlink(bool status)
{
  if (status) LCD_Byte(0xD,0);
  else LCD_Byte(0xC,0);
}

static void gotoxy(short x, short y)
{
  if (y==1) x+=0x40;
  else if (y==2) x+=0x14;
  else if (y==3) x+=0x54;
  LCD_Byte(0x80+x,0);
}

static unsigned char GetKey()
{
  volatile unsigned char i,j,k=0,l=0;

  for (j=0;j<6;j++)
  {
    P2OUT&=0xC0;
    P2OUT|=(1<<j);

    P1OUT&=~SR_LATCH;
    delay_ms(1);
    P1OUT|=SR_LATCH;

    k=0;
    for (i=0;i<8;i++)
    {
      k<<=1;
      if (P1IN & SR_DATA)
      {
        k++;
        return j*7+i;
      }

      P1OUT&=~SR_CLOCK;
      delay_ms(1);
      P1OUT|=SR_CLOCK;

    }
  }
  return 0;
}

static unsigned char RAM_Read(const unsigned char *a1)
{
  unsigned char data;
  UART_Send(SlaveRAM_Read,true);
  UART_SendWord((unsigned int)a1,true);
  return UART_Receive(false);
}

//make while into nop
static void RAM_Write(const unsigned char *a1, const unsigned char byte)
{
  UART_Send(SlaveRAM_Write,true);
  UART_SendWord((unsigned int)a1,true);
  UART_Send(byte,true);
}

static void AddBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2)
{
  UART_Send(SlaveAdd,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)n1,true);
  UART_SendWord((unsigned int)n2,true);
}

static void SubBCD(unsigned char *result, const unsigned char *n1, unsigned char *n2)
{
  UART_Send(SlaveSubtract,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)n1,true);
  UART_SendWord((unsigned int)n2,true);
}

static void ImmedBCD(const char *text, unsigned char *BCD)
{
  int text_ptr=0;
  do
  {
    perm_buff2[text_ptr]=(unsigned char)text[text_ptr];
  } while(text[text_ptr++]);
  BufferBCD(perm_buff2,BCD);
}

static void BufferBCD(const unsigned char *text, unsigned char *BCD)
{
  UART_Send(SlaveBuffer,true);
  UART_SendWord((unsigned int)text,true);
  UART_SendWord((unsigned int)BCD,true);
}

static void PrintBCD(const unsigned char *BCD, int dec_point)
{
  #pragma MM_VAR BCD
  int BCD_ptr,BCD_end;
  bool zero=true;

  BCD_end=BCD[BCD_LEN]+3;
  if (dec_point>=0)
  {
    if ((BCD[BCD_LEN]-BCD[BCD_DEC])>dec_point)
    {
      BCD_end=BCD[BCD_DEC]+dec_point+3;
    }
  }

  if (BCD[BCD_SIGN]==1) putchar('-');
  for (BCD_ptr=3;BCD_ptr<BCD_end;BCD_ptr++)
  {
    if (BCD_ptr==BCD[BCD_DEC]+3) putchar('.');
    if (BCD[BCD_ptr]>9) putchar('x');
    else putchar('0'+BCD[BCD_ptr]);
  }
}

static void MultBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2)
{
  UART_Send(SlaveMultiply,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)n1,true);
  UART_SendWord((unsigned int)n2,true);
}

static void DivBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2)
{
  UART_Send(SlaveDivide,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)n1,true);
  UART_SendWord((unsigned int)n2,true);
}

static void ShrinkBCD(unsigned char *dest,unsigned char *src)
{
  UART_Send(SlaveShrink,true);
  UART_SendWord((unsigned int)dest,true);
  UART_SendWord((unsigned int)src,true);
}

static void FullShrinkBCD(unsigned char *n1)
{
  UART_Send(SlaveFullShrink,true);
  UART_SendWord((unsigned int)n1,true);
}

static void PadBCD(unsigned char *n1, int amount)
{
  UART_Send(SlavePad,true);
  UART_SendWord((unsigned int)n1,true);
  UART_SendWord((unsigned int)amount,true);
}

static bool IsZero(unsigned char *n1)
{
  UART_Send(SlaveIsZero,true);
  UART_SendWord((unsigned int)n1,true);
  if (UART_Receive(false)) return true;
  return false;
}

static void CopyBCD(unsigned char *dest, unsigned char *src)
{
  UART_Send(SlaveCopy,true);
  UART_SendWord((unsigned int)dest,true);
  UART_SendWord((unsigned int)src,true);
}

