druzyek/RPN_Calculator/MSP430/rpnmain.c
static bool LnBCD(unsigned char *result, unsigned char *arg)
{
  UART_Send(SlaveLn,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
  if (UART_Receive(false)) return true;
  return false;
}

static void ExpBCD(unsigned char *result, unsigned char *arg)
{
  UART_Send(SlaveExp,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
}

static void RolBCD(unsigned char *result, unsigned char *arg, unsigned int amount)
{
  UART_Send(SlaveRol,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
  UART_SendWord(amount,true);
}

static void RorBCD(unsigned char *result, unsigned char *arg, unsigned int amount)
{
  UART_Send(SlaveRor,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
  UART_SendWord(amount,true);
}

static void PowBCD(unsigned char *result, unsigned char *base, unsigned char *exp)
{
  UART_Send(SlavePow,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)base,true);
  UART_SendWord((unsigned int)exp,true);
}

static void TanBCD(unsigned char *sine_result,unsigned char *cos_result,unsigned char *arg)
{
  unsigned int a0;

  UART_Send(SlaveTan,true);
  UART_SendWord((unsigned int)sine_result,true);
  UART_SendWord((unsigned int)cos_result,true);
  UART_SendWord((unsigned int)arg,true);
}

static void AcosBCD(unsigned char *result,unsigned char *arg)
{
  UART_Send(SlaveAcos,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
}

static void AsinBCD(unsigned char *result,unsigned char *arg)
{
  UART_Send(SlaveAsin,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
}

static void AtanBCD(unsigned char *result,unsigned char *arg)
{
  UART_Send(SlaveAtan,true);
  UART_SendWord((unsigned int)result,true);
  UART_SendWord((unsigned int)arg,true);
}

static void CalcTanBCD(unsigned char *result1,unsigned char *result2,unsigned char *result3,unsigned char *arg,unsigned char flag)
{
  UART_Send(SlaveCalcTan,true);
  UART_SendWord((unsigned int)result1,true);
  UART_SendWord((unsigned int)result2,true);
  UART_SendWord((unsigned int)result3,true);
  UART_SendWord((unsigned int)arg,true);
  UART_Send(flag,true);
}

static unsigned char CompBCD(const char *num, unsigned char *var)
{
  ImmedBCD(num,p0);
  return CompVarBCD(p0,var);
}

static unsigned char CompVarBCD(unsigned char *var1, unsigned char *var2)
{
  UART_Send(SlaveCompVar,true);
  UART_SendWord((unsigned int)var1,true);
  UART_SendWord((unsigned int)var2,true);
  return UART_Receive(false);
}

static unsigned char TrigPrep(unsigned int stack_ptr_copy, int *cosine)
{
  UART_Send(SlaveTrigPrep,true);
  UART_SendWord(stack_ptr_copy,true);
  *cosine=(int)UART_Receive(false);
  return UART_Receive(false);
}

void DrawStack(bool menu, bool input, int stack_pointer)
{
  int i,j=4,k,k_end,l,m;
  if (menu) j--;
  if (input) j--;
  for (i=0;i<j;i++)
  {
    gotoxy(0,i);
    putchar('0'+j-i);
    putchar(':');
    if ((stack_pointer-j+i)>=0)
    {
      if (BCD_stack[(stack_pointer-j+i)*MATH_CELL_SIZE+BCD_DEC]==0)
      {
        PadBCD(BCD_stack+(stack_pointer-j+i)*MATH_CELL_SIZE,1);
      }
      CopyBCD(p1,BCD_stack+(stack_pointer-j+i)*MATH_CELL_SIZE);

      if (Settings.SciNot)
      {
        if (IsZero(p1)) LCD_Text("0.e0");
        else
        {
          k=0;
          for (l=0;l<p1[BCD_LEN];l++) if (p1[l+3]) k=l;
          p1[BCD_LEN]=k+1;

          for (l=0;l<p1[BCD_LEN];l++) if (p1[l+3]!=0) break;

          m=0;
          k=(p1[BCD_DEC]-l-1);//length of e
          if (k<0) k=-k;
          if (p1[BCD_SIGN]) m++;
          if (k>9) m++;
          if (k>99) m++;
          if ((p1[BCD_DEC]-l-1)<0) m++;

          if ((16-m)>(p1[BCD_LEN]-l))
          {
            k_end=p1[BCD_LEN]-l;
            m=17-k_end-m;
          }
          else
          {
            k_end=15-m;
            m=2;
          }

          gotoxy(m,i);
          if (p1[BCD_SIGN]) putchar('-');
          for (k=0;k<k_end;k++)
          {
            putchar(p1[k+l+3]+'0');
            if (k==0) putchar('.');
          }

          putchar('e');
          k=p1[BCD_DEC]-l-1;
          if (k<0)
          {
            putchar('-');
            k=-k;
          }
          m=0;
          if (k/100) {putchar('0'+(k/100));m=1;}
          if (((k%100)/10)||m) {putchar('0'+(k%100)/10);m=1;}
          putchar('0'+k%10);
        }
      }
      else
      {
        k=p1[BCD_LEN];

        while ((p1[k+2]==0)&&(k!=p1[BCD_DEC]))
        {
          p1[BCD_LEN]-=1;
          k--;
        }
        k_end=p1[BCD_LEN];
        if (k_end>=18)
        {
          k=0;
          k_end=18;
          if (p1[BCD_SIGN]) k_end--;
          if (p1[BCD_DEC]<k_end) k_end--;
        }
        else if (k_end==17)
        {
          k=1;
          if (p1[BCD_SIGN]) k=0;
          if (p1[BCD_DEC]<k_end)
          {
            if (k==0) k_end--;
            else k=0;
          }
        }
        else
        {
          k=SCREEN_WIDTH-k_end-2;
          if (p1[BCD_SIGN]) k--;
          if (p1[BCD_DEC]<p1[BCD_LEN]) k--;
        }

        gotoxy(k+2,i);
        if (p1[BCD_SIGN])
        {
          putchar('-');
          k++;
        }
        for (l=3;l<k_end+3;l++)
        {
          putchar(p1[l]+'0');
          if (p1[BCD_DEC]==l-2)
          {
            if (l+k<20) putchar('.');
          }
        }
        if (p1[BCD_DEC]>k_end)
        {
          gotoxy(19,i);
          putchar('>');
        }
      }
    }
  }
}

void DrawInput(unsigned char *line, int input_ptr, int offset, bool menu)
{
  #pragma MM_VAR line

  int i,j=4;
  bool done=false;

  if (menu) j--;
  gotoxy(0,j-1);

  for (i=0;i<SCREEN_WIDTH;i++)
  {
    if ((i==0)&&(offset>0)) putchar('<');
    else if ((i==SCREEN_WIDTH-1)&&(line[i+offset+1])&&(!done))
    {
      if (line[i+offset])
      {
        putchar('>');
      }
    }
    else
    {
      if (!done)
      {
        if (line[i+offset]) putchar(line[i+offset]);
        else
        {
          done=true;
        }
      }
      if (done) putchar(' ');
    }
  }
  gotoxy(input_ptr-offset,j-1);
}

static void ErrorMsg(const char *msg)
{
  int i,j=0,tx,char_max=5,height=1;

  enum {CUST_NW,CUST_NE,CUST_WE,CUST_SW,CUST_S,CUST_OK_O,CUST_OK_K,CUST_E};

  for (i=0;msg[i];i++)
  {
    if (msg[i]=='\n')
    {
      j=0;
      height++;
    }
    else
    {
      j++;
      if (j>char_max) char_max=j;
    }
  }
  tx=SCREEN_WIDTH/2-(char_max+1)/2;
  if (height==4) height=0;
  else height=1;
  gotoxy(tx-1,height-1);

  putchar(CUST_NW);
  for (j=0;j<char_max;j++) putchar('_');
  putchar(CUST_NE);
  gotoxy(tx-1,height);
  putchar(CUST_WE);

  j=0;
  for (i=0;msg[i];i++)
  {
    if (msg[i]=='\n')
    {
      for (;j<char_max;j++) putchar(' ');
      putchar(CUST_WE);
      j=0;
      height++;
      gotoxy(tx-1,height);
      putchar(CUST_WE);
    }
    else
    {
      j++;
      putchar(msg[i]);
    }
  }
  for (;j<char_max;j++) putchar(' ');
  putchar(CUST_WE);
  height++;
  gotoxy(tx-1,height);
  putchar(CUST_SW);
  for (j=1;j<char_max;j++) putchar(CUST_S);
  putchar(CUST_OK_O);
  putchar(CUST_OK_K);

  while (KeyMatrix[GetKey()]!=13);
  delay_ms(1000);
}

static void Number2(int num)
{
  if (num<10)
  {
    putchar(' ');
    putchar(num+'0');
  }
  else
  {
    putchar(num/10+'0');
    putchar(num%10+'0');
  }
}

static void SetDecPlaces()
{
  int i,j=2,x;

