druzyek/RPN_Calculator/MSP430/rpnmain.c
  for (x=0;x<2;x++)
  {
    if (x==0) P1OUT&=~RAM_BANK;
    else P1OUT|=RAM_BANK;

    j=2;
    for (i=0;i<MATH_TRIG_TABLE;i++)
    {
      trig[i*MATH_ENTRY_SIZE+BCD_LEN]=j+Settings.DecPlaces;
      if (IsZero(trig+i*MATH_ENTRY_SIZE)) break;
    }
    Settings.TrigTableSize=i+1;
    for (i=0;i<MATH_LOG_TABLE;i++)
    {
      logs[i*MATH_ENTRY_SIZE+BCD_LEN]=j+Settings.DecPlaces;
      if (IsZero(logs+i*MATH_ENTRY_SIZE)) break;
    }
    Settings.LogTableSize=i+1;//this was +0 on slave

    perm_K[BCD_LEN]=1+Settings.DecPlaces;
    perm_log10[BCD_LEN]=1+Settings.DecPlaces;
  }
  if (which_stack==0) P1OUT&=~RAM_BANK;
  else P1OUT|=RAM_BANK;
}

static void TestRAM()
{
  unsigned int ia;
  unsigned int address,oldaddress;
  ClrLCD();
  LCD_Text("Testing RAM ");
  if (RAM_BANK&P1OUT) putchar('1');
  else putchar('0');
  LCD_Text("...");

  #define ADDRESS_RANGE 65535

  address=0;
  oldaddress=1;
  gotoxy(0,2);
  LCD_Text("Writing...");

  while (address!=ADDRESS_RANGE)
  {
    for (ia=0;ia<138;ia++)
    {
      if ((address>>8)!=oldaddress)
      {
        gotoxy(0,3);
        LCD_Num(address>>8);
        oldaddress=address>>8;
      }

      RAM_Write((unsigned char*)address,ia&0xFF);
      address++;
      if (address==ADDRESS_RANGE) break;
    }
  }
  address=0;
  oldaddress=1;
  gotoxy(0,2);
  LCD_Text("Reading...");
  while (address!=ADDRESS_RANGE)
  {
    for (ia=0;ia<138;ia++)
    {
      if ((address>>8)!=oldaddress)
      {
        gotoxy(0,3);
        LCD_Num(address>>8);
        oldaddress=address>>8;
      }
      if (ia!=RAM_Read((unsigned char*)address))
      {
        gotoxy(0,1);
        LCD_Text("Mismatch 0x");
        LCD_Hex(address>>8);
        LCD_Hex(address&0xFF);
        putchar(':');
        LCD_Num(ia);
        for(;;);
      }
      address++;
      if (address==ADDRESS_RANGE) break;
    }
  }
}
